/// 樹果
enum Fruit {
  f1(1, '柿仔果', 120, '一般'),
  f2(2, '蘋野果', 116, '火'),
  f3(3, '橙橙果', 133, '水'),
  f4(4, '萄葡果', 107, '電'),
  f5(5, '金枕果', 129, '草'),
  f6(6, '莓莓果', 137, '冰'),
  f7(7, '櫻子果', 116, '格鬥'),
  f8(8, '零餘果', 137, '毒'),
  f9(9, '勿花果', 124, '地面'),
  f10(10, '椰木果', 103, '飛行'),
  f11(11, '芒芒果', 112, '超能'),
  f12(12, '木子果', 103, '蟲'),
  f13(13, '文柚果', 129, '岩石'),
  f14(14, '墨莓果', 112, '幽靈'),
  f15(15, '番荔果', 150, '龍'),
  f16(16, '異奇果', 133, '惡'),
  f17(17, '靛莓果', 142, '鋼'),
  f18(18, '桃桃果', 112, '妖精');

  const Fruit(this.id, this.nameI18nKey, this.energyIn60, this.attr);

  /// Custom id from this app
  final int id;

  /// ex: 金枕果 (translated)
  final String nameI18nKey;

  /// 能量
  final int energyIn60;

  /// 屬性
  final String attr;
}