// "1": "專注薰香",
// "2": "幸運薰香",
// "3": "成長薰香",
// "4": "回復薰香",
// "5": "活力枕頭",
// "6": "幫手哨子",
// "7": "營地移動券",
// "8": "好露營券",
// "9": "寶可沙布蕾",
// "10": "超級沙布蕾",
// "11": "大師沙布蕾",
// "12": "萬能糖果S",
// "13": "萬能糖果M",
// "14": "萬能糖果L",
// "15": "食材券S",
// "16": "食材券M",
// "17": "食材券L",
// "18": "夢之塊S",
// "19": "夢之塊M",
// "20": "夢之塊L",
// "21": "聯繫繩",
// "22": "火之石",
// "23": "水之石",
// "24": "雷之石",
// "25": "葉之石",
// "26": "冰之石",
// "27": "月之石",
// "28": "光之石",
// "29": "金屬膜",
// "30": "渾圓之石",
// "31": "王者之證",
// "32": "主技能種子",
// "33": "副技能種子",
// "34": "友好薰香"

import 'package:collection/collection.dart';

enum GameItem {
  i1(1, 't_item_1'),
  i2(2, 't_item_2'),
  i3(3, 't_item_3'),
  i4(4, 't_item_4'),
  i5(5, 't_item_5'),
  i6(6, 't_item_6'),
  i7(7, 't_item_7'),
  i8(8, 't_item_8'),
  i9(9, 't_item_9'),
  i10(10, 't_item_10'),
  i11(11, 't_item_11'),
  i12(12, 't_item_12'),
  i13(13, 't_item_13'),
  i14(14, 't_item_14'),
  i15(15, 't_item_15'),
  i16(16, 't_item_16'),
  i17(17, 't_item_17'),
  i18(18, 't_item_18'),
  i19(19, 't_item_19'),
  i20(20, 't_item_20'),
  i21(21, 't_item_21'),
  i22(22, 't_item_22'),
  i23(23, 't_item_23'),
  i24(24, 't_item_24'),
  i25(25, 't_item_25'),
  i26(26, 't_item_26'),
  i27(27, 't_item_27'),
  i28(28, 't_item_28'),
  i29(29, 't_item_29'),
  i30(30, 't_item_30'),
  i31(31, 't_item_31'),
  i32(32, 't_item_32'),
  i33(33, 't_item_33'),
  i34(34, 't_item_34');

  const GameItem(this.id, this.nameI18nKey);

  final int id;
  final String nameI18nKey;

  static GameItem? getById(int id) {
    return GameItem.values.toList().firstWhereOrNull((e) => e.id == id);
  }

}
